<?php
// 15.04.2019
//
// Григорьев Петр
//
// скрипт для генерации 26^5=11881376 уникальных ключей отсортированных лексикографически
// и случайных значений, объем полученного файла примерно 159Mb


$handle = fopen("asd.txt", "w");

for ($i = 97; $i <= 122; $i++) {
    for($j = 97; $j <= 122; $j++) {
        for($k = 97; $k <= 122; $k++) {
            for ($l = 97; $l <= 122; $l++) {
                for ($m = 97; $m <= 122; $m++) {
                    $str = chr($i) . chr($j) . chr($k) . chr($l) . chr($m) . chr(9) . rand(1, 500000) . PHP_EOL;
                    fwrite($handle, $str);
                    $str = '';                    
                }
            }
        }
    }
}
fclose($handle);